2020년 회고

핵심을 찌르는 한마디. 좋은 증명에는 더욱 적은 요소들만 사용된다고 한다.
문제를 간단하게정의하고, 간단한 해결 방법을 제시하는 것은 매우 지향할만한
것이다. 그러기에 2020년 회고에도 비슷하게 적용할 수 있겠다. 이전에 작성한
2020년 회고는 단순한 사실만을 나열한 쓰레기에 가깝다. 그러기에 다시 작성한다.

> 작은 사건에서 변화를 만들어낸다.

작년을 추억하면서 나의 성장의 원동력을 뽑으라면 바로 이것이다. 나는 변화를
만들기 위한 시도를 많이 하고, 그러한 점은 내가 더 나은 사람이 되는데 많은
기여를 한다.

작은 사건이라는 것은 주로 이런 것이다. 회사에 애자일 스터디가 새로 만들어졌다.
점심을 배달시켜 먹을 때, 배달 시키는 일을 2주마다 돌아가기로 정했다. 나는
그 다음날 출근길에 전 날에 있던 일들을 생각해보았다. 1달마다 돌아가면 더 빠른
피드백이 가능하지 않을지 말이다. 그래서 나는 애자일 스터디 슬랙에 그러한 내용의
글을 올렸다. 그래서 나온 반응은 "우리 2주마다 하기로 한거 아니었어?"와 
"피드백을 빠르게 받는 것은 중요하지만, 그렇다고 처음부터 아무렇게나 하자는건
효과가 안좋을 수 있다" 라는 것이었다. 실제 논의에서는 ICE를 이야기하면서
내가 ICE를 사용할 때 E를 너무 많이 중요하게 생각한 나머지, I, C를 크게
신경쓰지 않는 다는 것을 알게 되었다. 나중에 "뭐가 더 쉽지? 빨리 할 수 있지"를
생각하게 될 때 "혹시 더 중요하거나 큰 영향력을 끼키게 되는건 뭐지"를 함께
생각하는 경우가 늘었다.

나는 다른 사람과의 대화에서도 많은 변화를 이끌어낼 수 있다. 9월경에 회사에서
Whale이라는 내가 좋아하는 분과 커피를 마시러 갈 때 나눈 이야기로 꽤 많은게
바뀐 적이 있다. 그 분은 "트위터 들어가면 라스 트윗밖에 안보여요"라고 하셨다.
그러면서 하루에 몇개나 하는지 물어보셨고, 4개라고 하자 더 많지 않냐고 하셨다.
이렇게만 보면 많이 평범한 대화이다. 그러나 나는 그 뒤로도 그 대화가 마음에
걸렸다. 혹시 내가 트위터를 너무 많이 하는것이 아닌가 점검을 하게 되는 계기가
되었고, 실제로 그 이후로는 트위터를 너무 많이 하지 않게 되었다. (물론 최근은
애인과 헤어진 다음 많이 하고 있다...)

다른 변화도 매우 많다. "~죠"라는 어미를 많이 쓴다는 이야기를 들어서
너무 단정적인 말투 대신 다른 말투를 쓰도록 실험한 적도 있다. 코딩도장에서의
커밋 로그도 그 이후 일하는 방식을 바꾸는데 큰 역할을 주었다. 이러한 작은
변화들을 만들어내고, 실제로 실행해보는 것이 나의 큰 장점이라고 생각한다.

> 습관적으로 이루어지는 회고

작은 사건에서 내가 변화하는 계기가 만들어지긴 하지만, 실제로 그걸 싹피우는
행동은 회고이다. 앞서서 한 이야기를 보았다면, 실제 사건이 있는 다음, 그 사건을
되돌아보며 실제로 변화를 만들어냈다는 것을 알 수 있다. 적어도 큰 영향을 주고
있다. 이러한 회고는 아주 많은 일에 무의식적으로 이루어진다. 나는 회고를 많이
하는 편은 아니다. "회고를 위해 시간을 얼마나 쓰세요?"라는 질문을 받으면
1주일에 1시간 미만이라고 답을 하겠지만, "몇번이나 회고를 하세요?"라고 묻는다면
100번 이상이라고 답한다.

나는 꽤나 오래 전 일들을 떠올리며 회고하는 시간이 많다. 그러한 생각을 하는 것은
주로 출근/퇴근 시간이다. (출퇴근 하기위해 10분 이상 걸어야 하는 회사의 위치에
감사를...) 2년전에 있던 애자일 페스트나, 그로스 해킹X페스트, Paul과의 커피타임
아샬님과 나눈 이야기, 학교에서의 생활등이 주제이다. 예를들어 애자일 페스트에서
신철님이 하신 "라스는 운명이라고 생각하는 연애 상대가 있었나요"라는 질문에 있다고
말 한 것은 아직도 가끔 생각이 난다.

이런 예전 일 뿐만 아니라 오늘은 어떤 날일 것 같고, 어떤 일들을 이뤄냈고 회의는
어땠는지 회고하는 편이다. 그러면서 발견할 수 있는 것들이 있었다. 예를들어 나는
지라 카드를 done으로 많이 옮기면 일을 많이 했다고 느끼고, 하루의 만족감이 올라간다.
그러기에 의욕이 없으면 카드를 많이 만들어서 성취감을 느껴서 다시 모티베이션을 올리곤
한다. 이렇듯 자기 성찰을 많이 하는 점은 장점이라고 생각한다.

> 회고의 핵심

https://laswonho.medium.com/2020%ED%9A%8C%EA%B3%A0-50e191a16c6a
이게 내가 2020/12/30일에 작성한 회고이다. 이 글에서는 이 회고의 핵심을 뽑았다.
사실 두 글 모두 내가 얻은 인사이트를 전부 나열하기란 솔직히 불가능하다. 그러기에
중요하다고 생각하는 부분만 추렸다. 사실 조금 더 추가하고 싶은 점은 좋은 사람들이
주위에 있는 것과 운이 좋다는 부분이다. 운이 좋은 이유는 많이 시도하기 때문이며,
좋은 사람들이 많이 있는 이유는 일부러 그러한 환경을 만들었기 때문이다. 결국에는
내가 스스로 움직였기 때문에 만들어진 것이다. 가만히 있으면 아무것도 변하지 않는다.
그러기에 나는 작은 변화들을 많이 만들고 시도해본다. 그런 변화를 만드는 과정에는
잦은 회고가 있다. 두려워도 시도해보는 것. 이게 나의 가장 큰 장점이다.